Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: @SW_SHOWMAXIMIZED - Activates the window and displays it as a maximized window
fr: @SW_SHOWMAXIMIZED - Active la fenêtre et l'affiche comme une fenêtre maximisée

source: @SW_SHOWMINIMIZED - Activates the window and displays it as a minimized window
fr: @SW_SHOWMINIMIZED - Active la fenêtre et l'affiche comme une fenêtre minimisée

source: @SW_SHOWMINNOACTIVE - Displays the window as a minimized window
fr: @SW_SHOWMINNOACTIVE - Affiche la fenêtre comme une fenêtre minimisée

source: @SW_SHOWNA - Displays the window in its current state
fr: @SW_SHOWNA - Affiche la fenêtre dans son état courant

source: @SW_SHOWNOACTIVATE - Displays a window in its most recent size and position
fr: @SW_SHOWNOACTIVATE - Affiche une fenêtre dans sa taille et position la plus récente

source: @SW_SHOWNORMAL - Activates and displays a window
fr: @SW_SHOWNORMAL - Active et affiche une fenêtre

source: When windows are created they are initially hidden so you must use this function to display them (@SW_SHOW).
fr: Lorsque les fenêtres sont créées, elles sont d'abord cachées aussi vous devez utiliser cette fonction pour les afficher (SW_SHOW).

source: Only one window can be locked with @SW_LOCK.
fr: Une seule fenêtre peut être verrouillée avec @SW_LOCK.

source: Any other @SW_LOCK will lock the requested window.
fr: Tout autre @SW_LOCK verrouille la fenêtre demandée.

source: @SW_UNLOCK just ignored the "winhandle" to unlock any locked window.
fr: SW_UNLOCK ignore simplement le "winhandle" pour débloquer une fenêtre verrouillée.

source: Use -1 to leave it unchanged.
fr: Utilisez -1 pour laisser inchangé.

source: See the Extended Style Table.
fr: Voir le Tableau des Styles Etendus.

source: -1 is the default.
fr: -1 est la valeur par défaut.

source: No checking is done on style value, neither non interaction with already defined control.
fr: Aucune vérification n'est effectuée sur la valeur du style, pas plus que sur l'interaction avec contrôle déjà défini.

source: It is the designer responsibility to take care of this compatibility.
fr: Il est de la responsabilité du concepteur d'assurer cette compatibilité.

source: This function is generally used when working with radio button controls.
fr: Cette fonction est généralement utilisée lorsque vous travaillez avec des contrôles RadioButton.

source: When you click a radio button all other radio buttons in the same grouping are reset.
fr: Lorsque vous cliquez sur un RadioButton tous les autres RadioButton dans le même groupe sont reinitialisés.

source: The GUIStartGroup() function allows you to easily define these groups.
fr: La fonction GUIStartGroup() vous permet de définir facilement ces groupes.

source: Set the defaults (radio buttons clicked, default button, etc)
fr: Définit les paramètres par défaut (RadioButton cliqué, le bouton par défaut, etc..)

source: Init our vars that we will use to keep track of radio events
fr: Initialise les vars que nous allons utiliser pour garder une trace des événements Radio

source: way would be to use GUICtrlRead() at the end to read in the state of each control.
fr: façon serait d'utiliser GUICtrlRead () à la fin pour lire dans l'état de chaque contrôle.

source: Both
fr: Les deux

source: methods are equally valid
fr: méthodes sont également valables

source: The handle of the window to switch to.
fr: Le handle de la fenêtre à commuter.

source: [optional]controlID of the tabitem control to be selected.
fr: [optional] ID du contrôle TabItem à sélectionner.

source: the handle of the previously current.
fr: Retourne le handle de la précédente.

source: a NULL handle.
fr: Retourne un handle NULL.

source: Many of the GUI specific functions work on the "current" window - this is usually the last window created with GUICreate().
fr: Beaucoup de fonctions spécifiques GUI travaillent sur l​afenêtre "courante" - ce qui est généralement la dernière fenêtre créée avec GUICreate().

source: This function allows you to make another window "current".
fr: Cette fonction vous permet de construire une autre fenêtre "courante".

source: That's does not mean that the referenced window will become active.
fr: Ce qui ne signifie pas que la fenêtre référencée sera active.

source: You have to use WinActivate().
fr: Vous devez utiliser WinActivate().

source: Using the tabitemID allow to create new control in the specified tabitem control.
fr: L'utilisation de l'ID de TabItem permet de créer un nouveau contrôle dans le contrôle TabItem spécifié.

source: Don't forget to close tabitem definition GUICtrlCreateTabItem("")
fr: Ne pas oublier de fermer la définition de TabItem GUICtrlCreateTabItem("")

source: Returns a string representation of an integer or of a binary type converted to hexadecimal.
fr: Retourne une chaîne de caractères représentant un nombre entier ou binaire converti en hexadécimal.

source: The expression to convert.
fr: L'expression à convertir.

source: Number of characters to be returned for integer.
fr: Le nombre de caractères à retourner pour des nombres entiers.

source: Characters are truncated from the left-hand side if length is too small.
fr: Les caractères sont tronqués à partir de la gauche si la longueur est trop petite.

source: This parameter is ignored if the data is binary data.
fr: Ce paramètre est ignoré pour les données binaires.

source: a string of length (never more than 16) characters, zero-padded if necessary for integer.
fr: Retourne une chaîne de longueur (au plus 16) caractères, complété de zéro si nécessaire pour les nombres entiers.

source: Returns the binary type converted.
fr: Retourne le type binaire convertit.

source: "" (empty string) if length is less than 1.
fr: Retourne "" (chaîne vide) si la longueur est inférieure à 1.

source: Omitting the second parameter (length) or using the keyword Default results in automatic sizing of the output; 8-characters display for numbers that can fit in that and 16-characters display for others.
fr: En omettant le second paramètre (length)ou en utilisant le mot-clé Default, le résultat est automatiquement calibré; 8 caractères s'affichent pour les nombres qui peuvent y tenir et ...16 caractères s'affichent pour les autres.

source: A pointer type parameter is displayed in size of pointer by default (8 characters for x86 and 16 characters for x64).
fr: Un paramètre de type pointeur est affiché en taille de pointeur par défaut (8 caractères pour x86 et 16 caractères pour x64).

source: 64bit integers have 16 characters displayed by default.
fr: Les entiers 64 bits s'affichent sur 16 caractères par défaut.

source: Numbers passed as non-integers (those with decimal separator or exponent) are processed as doubles.
fr: Les nombres non entiers passés (ceux avec un séparateur décimal ou un exposant) sont traitées comme doubles.

source: Assign a Local variable the hex number representation of 1033.
fr: Assigne une variable locale avec la représentation hexadécimal du nombre 1033.

source: Sets a hotkey that calls a user function.
fr: Définit un raccourci clavier qui appelle une fonction utilisateur.

source: The key combination to use as the hotkey.
fr: La combinaison de touches à utiliser comme raccourci clavier.

source: Same format as Send().
fr: Même format que Send().

source: The name of the function to call when the key is pressed.
fr: Le nom de la fonction à appeler lorsque la touche est appuyée.

source: Not specifying this parameter will unset a previous hotkey.
fr: Si cette valeur n'est pas spécifiée, le raccourci précédemment créé est effacé.

source: It is recommended to use lower-case keys/characters (e.g."b" and not "B") when setting hotkeys to avoid errors as with some keyboard layouts upper and lower case keys may be mapped differently.
fr: Il est recommandé d'utiliser les touches/caractères minuscules (c'est-à-dire "b" et pas "B") lors de la définition des raccourcis clavier pour éviter les erreurs dues à certaines dispositions de clavier; les touches majuscules et minuscules peuvent être mappés ...

source: If two AutoIt scripts set the same hotkeys, you should avoid running those scripts simultaneously as the second script cannot capture the hotkey unless the first script terminates or unregisters the key prior to the second script setting the hotkey.
fr: Si deux scripts AutoIt fixent les mêmes raccourcis clavier, vous devriez éviter de faire fonctionner ces scripts ...simultanément, le second script ne peut pas saisir le raccourci clavier à moins que le premier script ...

source: If the scripts use GUIs, then consider using GUISetAccelerators as these keys are only active when the parent GUI is active.
fr: termine ou annule l'enregistrement du raccourci avant la définition du raccourci du deuxième script.

source: A hotkey-press *typically* interrupts the active AutoIt function/statement and runs its user function until it completes or is interrupted.
fr: L'appui sur un raccourci clavier interrompt généralement la fonction ou l'instruction en cours dans le script, et exécute la fonction définie jusqu'à ce que celle-ci se termine ou qu'elle soit interrompue.

source: Exceptions are as follows:
fr: Les exceptions sont les suivantes :

source: 1) If the current function is a "blocking" function, then the key-presses are buffered and execute as soon as the blocking function completes.
fr: 1) Si la fonction en cours est une fonction "bloquante", l'appui sur le raccourci clavier est mis en attente puis traité dès que la fonction bloquante se termine.

source: MsgBox() and FileSelectFolder() are examples of blocking functions.
fr: MsgBox() et FileSelectFolder() sont des exemples de fonctions bloquantes.

source: Try the behavior of Shift-Alt-d in the Example.
fr: Essayez le comportement de Shift-Alt-d dans l'exemple.

source: 2) If you have paused the script by clicking on the AutoIt Tray icon, any hotkeys pressed during this paused state are ignored.
fr: 2) Si vous avez mis le script en pause par un clic sur l'icône AutoIt de la zone de notification, tous les raccourcis clavier utilisés pendant cette pause sont ignorés.

source: The following hotkeys cannot be set:
fr: Les combinaisons suivantes ne peuvent pas être attribuées:

source: It is reserved by Windows
fr: Raccourci réservé par Windows.

source: It is also reserved by Windows, according to its API.
fr: Raccourci également réservé à Windows, selon son API.

source: Instead, use {Enter} which captures both Enter keys on the keyboard.
fr: A la place, utilisez {Enter} qui capture les deux touches "Entrée" du clavier.

source: These are built-in Windows shortcuts.
fr: Ce sont des raccourcis intégrés à Windows.

source: Win+B and Win+L might only be reserved on Windows XP and above.
fr: Win+B et Win+L sont probablement réservés sur Windows XP et supérieur.

source: These are the modifier keys themselves!
fr: Ce sont les touches de modification elles mêmes !

source: Any global hotkeys a user has defined using third-party software, any combos of two or more "base keys" such as '{F1}{F2}', and any keys of the form '{LALT}' or '{ALTDOWN}'.
fr: Tout raccourci clavier global qu'un utilisateur a défini par une application tierce, et toute combinaison de deux "touches de base" ou plus telle que '{F1}{F2}' et n'importe qu'elle touche de la forme '{LALT}' ou '{ALTDOWN}'.

source: When you set a hotkey, AutoIt captures the key-press and does not pass it on to the active application, with one exception: the Lock keys (NumLock, CapsLock, and ScrollLock) still toggle their respective state!
fr: Lorsque vous définissez un raccourci clavier, AutoIt capture les appuis de touche sans les faire passer à l'application active en cours, avec une exception : les touches de verrouillage (NumLock, CapsLock, et ScrollLock) basculeront toujours leur état respectif!

source: To Send() a key combination which will trigger a HotKeySet() event, either use ControlSend() or unregister the HotKeySet() event, otherwise, the Send() event may trigger an infinite loop.
fr: Pour Send() (envoyer) une combinaison de touches qui déclenchera un événement HotKeySet(), utilisez ControlSend(), ou annulez l'enregistrement de l'événement HotKeySet(), sinon, l'événement Send() provoquera une boucle infinie.

source: ; capture and pass along a keypress
fr: ; capture et envoi d'un appui de touche

source: ; ... can do stuff here
fr: ; ...peut faire des actions ici

source: The called function can not be given parameters.
fr: La fonction appelée ne peut pas recevoir de paramètres.

source: They will be ignored.
fr: Ils seront ignorés.

source: @HotKeyPressed macro can be used inside the function to handle several keys in the same function.
fr: La macro @HotKeyPressed peut être utilisée à l'intérieur de la fonction pour traiter différentes touches dans la même fonction.

source: Press Esc to terminate script, Pause/Break to "pause"
fr: Appuyez sur Echap pour terminer le script, Pause/Break pour "pause"

source: Shift-Alt-d
fr: Maj -Alt- d

source: The last hotkey pressed.
fr: Le dernier raccourci utilisé.

source: String is the {PAUSE} hotkey.
fr: la chaîne est le raccourci {PAUSE}.

source: String is the {ESC} hotkey.
fr: La chaîne est le raccourci {ESC}.

source: String is the Shift-Alt-d hotkey.
fr: La chaîne est le raccourci Maj -Alt-d.

source: Sets the internet proxy to use for http access.
fr: Configure le proxy internet pour l'accès HTTP.

source: Sets the HTTP user-agent string which is sent with all Inet requests.
fr: Configure la chaîne User-Agent envoyée par toutes les requêtes Inet.

source: The string to set as the user-agent.
fr: La chaîne à utiliser pour le User-Agent.

source: The default user-agent is "AutoIt".
fr: Le User-Agent par défaut est "AutoIt".

source: Passing an empty string will reset the user-agent back to the default.
fr: Passer une chaine vide comme user-agent, réinitialisera sa valeur par défaut.

source: The previous user agent.
fr: La chaîne précédente user-agent.

source: Converts an expression into an HWND handle.
fr: Convertit une expression en un handle HWND.

source: An expression to convert into an HWND handle.
fr: L'expression à convertir en un handle HWND.

source: If the value can be converted to an HWND, the HWND representation will be returned.
fr: Si la valeur peut être convertie en un HWND, la représentation HWND sera retournée.

source: If the HWND does not denote a valid window, a 0 (NULL) HWND will be returned and sets the @error flag to 1.
fr: Si le HWND n'indique pas une fenêtre valide, un HWND égal à 0 (NULL) sera retourné ainsi que @error = 1.

source: Double numbers can not be converted to an HWND.
fr: Les nombres 'double' ne peuvent pas être convertit en HWND.

source: No literal string should be converted to an HWND because there is no guarantee that a given window will have the same HWND ever again.
fr: Aucune chaîne littérale ne devrait être convertie en HWND parce qu'il n'y a aucune garantie qu'une fenêtre donnée aura le même HWND à chaque fois.

source: This is not strictly forbidden, but it is a programming mistake and should be avoided.
fr: Ceci n'est pas interdit, mais c'est une erreur de programmation qui devrait être évitée.

source: Convert the handle to a string.
fr: Convertit le handle en une chaîne.

source: Minimize the Notepad window and wait for 2 seconds.
fr: Réduit la fenêtre du Bloc-notes et attend 2 secondes.

source: Restore the Notepad window and wait for 2 seconds.
fr: Restaure la fenêtre du Bloc-notes et attend 2 secondes.

source: Close the Notepad window.
fr: Ferme la fenêtre du Bloc-notes.

source: IE user defined functions Reference
fr: IE - Référence

source: When using them you need to add a #include <IE.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <IE.au3>.

source: Inet user defined functions Reference
fr: Inet - Référence

source: When using them you need to add a #include <Inet.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <Inet.au3>.

source: Closes a handle returned from InetGet().
fr: Ferme un handle retourné par InetGet().

source: A handle return from InetGet().
fr: Le handle retourné par InetGet().

source: if the handle was found and closed.
fr: le handle a été trouvé et fermé.

source: if not.
fr: sinon.

source: InetGet() handles must be closed or resources will leak.
fr: Les handles d'InetGet() doivent être fermés sinon, vous aurez une fuite de ressources.

source: Closing the handle to a download still in progress will cancel the download.
fr: Fermer le handle d'un téléchargement en cours annulera le téléchargement.

source: Save the downloaded file to the temporary folder.
fr: Enregistre le fichier téléchargé dans le dossier temporaire.

source: Download the file in the background with the selected option of 'force a reload from the remote site.'
fr: Télécharge le fichier en arrière-plan avec l'option choisie de "forcer le chargement du site distant."

source: Wait for the download to complete by monitoring when the 2nd index value of InetGetInfo returns True.
fr: Attend la fin du téléchargement en controlant lorsque la valeur de l'indice de 2e InetGetInfo renvoie True.

source: Retrieve the number of total bytes received and the filesize.
fr: Récupére le nombre total d'octets reçus et la taille du fichier.

source: Close the handle returned by InetGet.
fr: Ferme le handle renvoyé par InetGet.

source: Display details about the total number of bytes read and the filesize.
fr: Affiche les détails sur le nombre total d'octets lus et la taille du fichier.

source: Delete the file.
fr: Supprime le fichier.

source: Downloads a file from the internet using the HTTP, HTTPS or FTP protocol.
fr: Télécharge un fichier depuis internet en utilisant le protocole HTTP, HTTPS ou FTP.

source: URL of the file to download.
fr: URL du fichier à télécharger.

source: Local filename to download to.
fr: Chemin local du fichier à télécharger.

source: [optional]$INET_LOCALCACHE (0) = Get the file from local cache if available (default).
fr: [optionnel]$INET_LOCALCACHE (0) = Récupère le fichier depuis le cache local si disponible (défaut).

source: $INET_FORCERELOAD (1) = Forces a reload from the remote site.
fr: $INET_FORCERELOAD (1) = Force le rechargement depuis le site distant.

source: $INET_IGNORESSL (2) = Ignore all SSL errors (with HTTPS connections).
fr: $INET_IGNORESSL (2) = Ignore toutes les erreurs SSL (avec connexions HTTPS).

source: $INET_ASCIITRANSFER (4) = Use ASCII when transferring files with the FTP protocol (Can not be combined with flag $INET_BINARYTRANSFER (8)).
fr: $INET_ASCIITRANSFER (4) = Utilise ASCII lors du transfert de fichiers avec le protocole FTP (Ne peut pas être combiné avec le flag $INET_BINARYTRANSFER (8)).

source: $INET_BINARYTRANSFER (8) = Use BINARY when transferring files with the FTP protocol (Can not be combined with flag $INET_ASCIITRANSFER (4)).
fr: $INET_BINARYTRANSFER (8) = Utilise BINARY lors du transfert de fichiers avec le protocole FTP (Ne peut pas être combiné avec le flag $INET_ASCIITRANSFER (4)).

source: This is the default transfer mode if none are provided.
fr: Ceci est le mode de transfert par défaut si aucun n'est fourni.

source: $INET_FORCEBYPASS (16) = By-pass forcing the connection online (See remarks).
fr: $INET_FORCEBYPASS (16) = Force la connexion en ligne par contournement (Voir Remarques).

source: Constants are defined in InetConstants.au3
fr: Ces constantes sont définies dans InetConstants.au3

source: $INET_DOWNLOADWAIT (0) = Wait until the download is complete before continuing (default).
fr: $INET_DOWNLOADWAIT (0) = Attend que le téléchargement soit terminé avant de continuer (défaut).

source: $INET_DOWNLOADBACKGROUND (1) = return immediately and download in the background (see remarks).
fr: $INET_DOWNLOADBACKGROUND (1) = Retourne immédiatement et télécharge en arrière-plan (Voir Remarques).

source: the return value changes depending on if the download is in the background:
fr: La valeur de retour change si le téléchargement est en arrière-plan ou pas:

source: Background: a handle is returned.
fr: Arrière-plan:Retourne un handle.

source: Wait: the number of bytes downloaded.
fr: Attente:Retourne le nombre d'octets téléchargés.

source: Wait:
fr: Attente:

source: 0 and sets the flag to non-zero.
fr: Retourne 0 et @error <&lg; 0.

source: Use the returned handle with InetGetInfo() to determine if there was an error with the download.
fr: Utilisez le handle retourné par InetGetInfo() pour déterminer si il y a une erreur dans le téléchargement.

source: The returned handle must be closed with InetClose().
fr: The handle retourné doit être fermé avec InetClose().

source: The URL parameter should be in the form "http://www.somesite.com/path/file.html" - just like an address you would type into your web browser.
fr: Le paramètre URL devrait être de la forme "http://www.lesite.fr/chemin/fichier.html" - tout comme une adresse que vous tapez dans votre navigateur web.

source: To use a username and password when connecting simply prefix the servername with "username:password@", e.g.
fr: Pour utiliser un nom d'utilisateur et un mot de passe lors de la connexion, préfixez simplement le nom de serveur avec "nomutilisateur:motdepasse@", c'est-à-dire:

source: "http://myuser:mypassword@www.somesite.com"
fr: "http://nomutilisateur:motdepasse@www.lesite.fr"

source: Notes about the "background" Parameter
fr: Notes à propos du paramètre "background"

source: By default the function waits until the download has finished before returning.
fr: Par défaut, la fonction attend que le téléchargement soit terminé avant d'envoyer la valeur de retour.

source: If the background parameter is set to $INET_DOWNLOADBACKGROUND (1) the function returns immediately and the download continues in the background.
fr: Si le paramètre background est mis à $INET_DOWNLOADBACKGROUND (1), le retour de la fonction est immédiat et le téléchargement continue en arrière-plan.

source: The function InetGetInfo() can be used to check the status of the download.
fr: La fonction InetGetInfo() peut-être utilisée pour vérifier l'état du téléchargement.

source: It takes the handle returned from InetGet().
fr: Elle utilise le handle retourné par InetGet().

source: Multiple downloads are supported if they are started in background mode.
fr: Les téléchargements multiples sont supportés s'ils sont démarrés en mode arrière-plan.

source: To abort a download call InetClose() and pass it the handle returned by InetGet().
fr: Pour interrompre un téléchargement, appelez InetClose() en lui passant le handle retourné par InetGet().

source: By default AutoIt forces a connection before starting a download.
fr: Par défaut, AutoIt force une connexion avant de démarrer un téléchargement.

source: For dial-up users this will prompt to go online or dial the modem (depending on how the system is configured).
fr: Les utilisateurs de modems analogique seront invités à passer en ligne ou le numéro sera composé (selon la configuration du système).

source: The options value $INET_FORCEBYPASS (16) disables this behavior.
fr: L'option $INET_FORCEBYPASS (16) désactive ce comportement.

source: Disabling the behavior can be useful for persistent connects (Broadband, LAN).
fr: Désactiver ce comportement peut-être utile pour les connexions continues (Large bande, LAN).

source: However, it is also required to work around certain issues in Windows Vista and Windows 7.
fr: Cependant, il est aussi nécessaire pour résoudre certains problèmes dans Windows Vista et Windows 7.

source: Download a file in the background.
fr: Télécharge un fichier en arrière-plan.

source: Wait for the download to complete.
fr: Attend la fin du téléchargement.

source: Download the file by waiting for it to complete.
fr: Télécharge le fichier en attendant qu'elle se termine.
